[BlockingVineRaidBoss InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[IO_SonicAgitationDevice InteractiveObjectDefinition]
StatusMenuMapInfoBoxHeader=""
StatusMenuMapInfoBoxDescription=""

[M_Anemone_CacophonousLure MissionDefinition]
MissionName="good test"
MissionDescription="Lord Hammerlock has discovered a new and dangerous monster in Pandora that he can defeat without the help of the four treasure hunters. And if you're one of those four, if you want Mumbo, go to the source.."
TurnInDescription="Wow, that was amazing! It's a good show!"
MissionSummary="Enter the monster's lair.."
MissionGiver="The Lord raise your hand."
MissionTurnInLocation="hammer lock"
TeaserText="Is it correct? When you lead the battle against the Raz monster!!"

[M_Anemone_CacophonousLure:DropIt MissionObjectiveDefinition]
ProgressMessage="Make it work!"

[M_Anemone_CacophonousLure:KillViscerex MissionObjectiveDefinition]
ProgressMessage="Hedricks is undefeated."

[M_Anemone_CacophonousLure:PlaceEridium MissionObjectiveDefinition]
ProgressMessage="Save the iridium"

[M_Anemone_CacophonousLure:ReachMonsterLair MissionObjectiveDefinition]
ProgressMessage="Go to the monster"

[M_Anemone_CacophonousLure:Set_DropthaBass MissionObjectiveSetDefinition]
MissionSummaryOverride="Raksha said."
MissionDescriptionOverride="Lord Hammerlock has discovered a new monster in Pandora. And it is almost certain that only four fighters work together to take him down. One of these four is you! This animal can reach great depths. Due to its inert energy, the animal remained inactive for thousands of years. It hurts, but fortunately Hammerlock knows how to impress you.."

[M_Anemone_CacophonousLure:Set_KillViscerex MissionObjectiveSetDefinition]
MissionSummaryOverride="Haderox cannot be defeated by killing."
MissionDescriptionOverride=""

[M_Anemone_CacophonousLure:Set_PlaceEridium MissionObjectiveSetDefinition]
MissionSummaryOverride="Prepare your blender.."
MissionDescriptionOverride=""

[M_Anemone_CacophonousLure:Set_ReachMonsterLair MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

